# ViewDisplayBackground Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplayBackground Properties
ViewDisplayBackground Class See Also
---
The ViewDisplayBackground type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BackgroundColor | The color of the horizon when the type is 'Gradient'. |
| GroundColor | The color of the ground when the type is 'Gradient' or 'SunAndClouds'. |
| HorizontalImageOffset | The distance between the left viewport boundary and the left edge of the background image. |
| HorizontalImageScale | The horizontal scale of the background image; the scale of 1.0 puts the image pixel-to-pixel. |
| ImageFlags | The image alignment indicators when the type is 'Image'. |
| ImagePath | The path to the image file when the type is 'Image'. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SkyColor | The color of the sky when the type is 'Gradient'. |
| Type | The type of the background. |
| VerticalImageOffset | The distance between the bottom viewport boundary and the bottom edge of the background image. |
| VerticalImageScale | The vertical scale of the background image; the scale of 1.0 puts the image pixel-to-pixel. |

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace